Repository: giellalt/corpus-sme
Catalog: prestable/tmx/eng/ficti/lyrics/karasjok_kulturskole_yksi_meista_one_of_us_24.11.2009_sme.doc.tmx
Source language: sme
Languages: eng

source: Ja yeah yeah, Ipmil lea,
eng: One of Us

source: yeah yeah, Son buorre lea
eng: If God had a name, what would it be

source: Maid juos olmmoš livččii Son
eng: And would you call it to his face

source: Busses čohkká dego don
eng: If you were faced with him in all his glory

source: Ja son ruoktot jođus lea
eng: What would you ask if you had just one question

source: Beare ruoktot jođus lea
eng: In things like heaven and in Jesus and the Saints and all the prophets

source: Son beare ruoktot jođus lea
eng: Nu go holy rolling stone

source: Baicce juos báhppa riŋgesta
eng: Back up to heaven all alone
